{
	"FormatVersion": 2,
	"Namespace": "",
	"Children": [
		{
			"Source":
			{
				"Text": "..."
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "53B39CD04892A7B7B024928448F12DA2"
		},
		{
			"Source":
			{
				"Text": "..."
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "EB79571F4695A366C4EAFBAFA0866A45"
		},
		{
			"Source":
			{
				"Text": "0"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "31971F1841CEA20D8CD266835118E95C"
		},
		{
			"Source":
			{
				"Text": "1"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "77B015444A6864DFBC820CBC03CA5D04"
		},
		{
			"Source":
			{
				"Text": "1"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "FDDD8D484DA10C54E718F49E8D055266"
		},
		{
			"Source":
			{
				"Text": "1234"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "285A5BD740F889C181135FB8053F4DA9"
		},
		{
			"Source":
			{
				"Text": "1234"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "2E93AD494DF9A0A44B439AA37315CAEC"
		},
		{
			"Source":
			{
				"Text": "1234"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "58C1E0254E5F27B3E7F66AB2986A650B"
		},
		{
			"Source":
			{
				"Text": "1234"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "7A96CD104BE81380100D6BB9CFB2FDC4"
		},
		{
			"Source":
			{
				"Text": "1234"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "C7D337514254916623DD9A9FBD3161B4"
		},
		{
			"Source":
			{
				"Text": "290,138"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "817D8DCC4A2F4D354D0D5899716D32E2"
		},
		{
			"Source":
			{
				"Text": "30"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "A1EFAB234A719B54EAA0D4AB3FFFED20"
		},
		{
			"Source":
			{
				"Text": "9999"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "657762A34D7E1EE88F3441910DA9922C"
		},
		{
			"Source":
			{
				"Text": "9999"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "6BA907F34DBEB99735479A807D584A45"
		},
		{
			"Source":
			{
				"Text": "BP奖励"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "AF2D8A4841C9BF6918362BA8CA8A8790"
		},
		{
			"Source":
			{
				"Text": "BP奖励"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "EB91C60744A1B65BAD292C80950F8939"
		},
		{
			"Source":
			{
				"Text": "BUFF1(仅展示)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "9DEFA5B8493ACB8CD72CC1A2D7EF5943"
		},
		{
			"Source":
			{
				"Text": "BUFF2(仅展示)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "5AE6791547CEA5DD59F31D9FDB4F0C41"
		},
		{
			"Source":
			{
				"Text": "BUFF3(仅展示)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "97F97F7D4BC45A6C9C2ED98D8F5B3527"
		},
		{
			"Source":
			{
				"Text": "N"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "0A23133E4E14718D8DFCEE8F91B59AD3"
		},
		{
			"Source":
			{
				"Text": "N"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "0BB2430A4ED4A8AFB7276F8F315689BC"
		},
		{
			"Source":
			{
				"Text": "N"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "3D3548854B08D7FBDA1BCEA9C480F911"
		},
		{
			"Source":
			{
				"Text": "N"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "54393C2A48635DDB236DB49D4DF6F8C1"
		},
		{
			"Source":
			{
				"Text": "N"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "57078B7645B0E464C2F9DE8666012539"
		},
		{
			"Source":
			{
				"Text": "N"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "DBE461A849711A509B870896AAC0A7B9"
		},
		{
			"Source":
			{
				"Text": "N"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "DD5BCD794560B865FA3B2BA9C4DDE157"
		},
		{
			"Source":
			{
				"Text": "x500"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "4D6F2B6E422BF78F0C4E5F9401427A9B"
		},
		{
			"Source":
			{
				"Text": "x500"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "957C77D8459167AB401DE2A76787DA80"
		},
		{
			"Source":
			{
				"Text": "一键领取"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "55F06395426FC3A5725900ABB9FBE46E"
		},
		{
			"Source":
			{
				"Text": "一键领取"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "8FD89BC847FB194E0D8EDBB0E726584A"
		},
		{
			"Source":
			{
				"Text": "主动1(仅展示)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "B48F97C94104ED268554C2ACB52E6DF0"
		},
		{
			"Source":
			{
				"Text": "主动2(仅展示)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E5A50E584E37879456BCC4871F90F115"
		},
		{
			"Source":
			{
				"Text": "任务"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "5CE00BBD493E414D8D4009843C83374C"
		},
		{
			"Source":
			{
				"Text": "任务"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "F8A6430E47918E2C567766BF907B37F4"
		},
		{
			"Source":
			{
				"Text": "使用"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "F3340EF14607C706F50F67A6F773B3CF"
		},
		{
			"Source":
			{
				"Text": "全服排行榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "527207134957D190C0B621874E543872"
		},
		{
			"Source":
			{
				"Text": "单局击杀榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "87FE4C1C4F0FE35F8437FCAF886D74B2"
		},
		{
			"Source":
			{
				"Text": "单局击杀榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "D26D5B964377923396FAF683F67D4D09"
		},
		{
			"Source":
			{
				"Text": "历史最高得分榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "0C9A5AB04CE21C3F1603578A57079D84"
		},
		{
			"Source":
			{
				"Text": "名字最长应该9个字"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "A8AAEB58476788726FEA14B4A9AA3F56"
		},
		{
			"Source":
			{
				"Text": "售出"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "1F4C626149E727B7E56F7B94FD609A77"
		},
		{
			"Source":
			{
				"Text": "基础奖励"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "334729564F51BDF4C6C59EAC11D8767D"
		},
		{
			"Source":
			{
				"Text": "好友排行"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "371D915E4F55FD08811106AC812EAC9E"
		},
		{
			"Source":
			{
				"Text": "好友排行"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "419F6FF3467162377BF7C795B4669457"
		},
		{
			"Source":
			{
				"Text": "好友排行榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E9FE47D243E2016AD4682E965191861D"
		},
		{
			"Source":
			{
				"Text": "属性1(仅展示)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "6BC8699F40ED976F18539187EBB6FBB5"
		},
		{
			"Source":
			{
				"Text": "属性2(仅展示)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "472D922346BD6EC5D48C8F935F2D390D"
		},
		{
			"Source":
			{
				"Text": "属性3(仅展示)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "35A5C06942407D4511EAB1B8DA3F5260"
		},
		{
			"Source":
			{
				"Text": "当前拥有:99"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "B694265D464FB6FDD26C6C8C1C04055B"
		},
		{
			"Source":
			{
				"Text": "总分榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "1D8513F4456FFB8E01EBBDACE1EE5D37"
		},
		{
			"Source":
			{
				"Text": "总分榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "6BED894A4C5C3DC6AB41949E9DBA7A14"
		},
		{
			"Source":
			{
				"Text": "总分榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "FA2683C1465A0A80F4A21EAA7A69F0D1"
		},
		{
			"Source":
			{
				"Text": "排行榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "3629F3A646E402AA1F059A92208C4575"
		},
		{
			"Source":
			{
				"Text": "排行榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E6BD397B47852D7366CD9FA2D2D5E69A"
		},
		{
			"Source":
			{
				"Text": "文本"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "C888DAC0499C7103832B90A2F856F6BD"
		},
		{
			"Source":
			{
				"Text": "更多游戏"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "EA100D2C450EF8AB9F8D5F8C7875474F"
		},
		{
			"Source":
			{
				"Text": "更多游戏"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "8F6422644CF345D23A4342A25F84FCA4"
		},
		{
			"Source":
			{
				"Text": "更多游戏"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "C77BC0984D11E6858BF7F1B830696BCA"
		},
		{
			"Source":
			{
				"Text": "未上榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "5EC8AD4048E5F3B4645774B396DBBDB8"
		},
		{
			"Source":
			{
				"Text": "榜上人数："
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "BE281C734EB76168681C9AA43C633576"
		},
		{
			"Source":
			{
				"Text": "每周任务"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "53B69F1645FC48BA55A470BB610C3731"
		},
		{
			"Source":
			{
				"Text": "每周任务"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "82915C044E979AAB9CA2F89C8A54DED4"
		},
		{
			"Source":
			{
				"Text": "玩家名字七个字"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "1085CC0E4966F44C3A8D4C843B7F268C"
		},
		{
			"Source":
			{
				"Text": "玩家名字七个字"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "EB2AB1D44AA4F4524D833695A7E096F2"
		},
		{
			"Source":
			{
				"Text": "省排行榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "0F0CD4184CD7A915E95EACA1A6AD6EC8"
		},
		{
			"Source":
			{
				"Text": "等级榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "32275EE44BA46FC258C25F9E2122AB5A"
		},
		{
			"Source":
			{
				"Text": "等级榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E98056D94092D0A1B4CAE2B0C59F6160"
		},
		{
			"Source":
			{
				"Text": "米"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "3EA0A7E647E61363939C79877670F8B7"
		},
		{
			"Source":
			{
				"Text": "米"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "A3EE21DC436E1EF37934D1A2EACFF77A"
		},
		{
			"Source":
			{
				"Text": "累计击杀榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "3ADDBB5F4FD50D596C3D1390B978ED6B"
		},
		{
			"Source":
			{
				"Text": "累计击杀榜"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "74A9B9864F47A88ABEBEF2BAB6E95301"
		},
		{
			"Source":
			{
				"Text": "被动1(仅展示)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E711A32B4B9668DA52F0AE87C2B74544"
		},
		{
			"Source":
			{
				"Text": "被动2(仅展示)"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "2384AC7A4220FBB30AB66CB674E45761"
		},
		{
			"Source":
			{
				"Text": "装备/卸下"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "9D3887C74793A9313BF341BB66E5878A"
		},
		{
			"Source":
			{
				"Text": "装备名称"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "D14904F6495A5AF4B54A2EB4A9889C88"
		},
		{
			"Source":
			{
				"Text": "赛季任务"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "3F3B459B42F8D7359F6B528CE441CDF5"
		},
		{
			"Source":
			{
				"Text": "赛季任务"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "F098809B4D4583990183E2AFC85B7267"
		},
		{
			"Source":
			{
				"Text": "距离赛季结束还有"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "5C1E9CD841AEA73C43149595166909B8"
		},
		{
			"Source":
			{
				"Text": "距离赛季结束还有"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "B7E1DF5C44CE1080368D26BAFB9BA324"
		},
		{
			"Source":
			{
				"Text": "距离赛季结束还有"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "BBC00B514822889561831EA95CCF8B0A"
		},
		{
			"Source":
			{
				"Text": "进阶奖励"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "544AF3CC43863AF99DD509A350EC9C10"
		},
		{
			"Source":
			{
				"Text": "道具名称"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "E34EB16B485D6114236360A07B7CE2E9"
		},
		{
			"Source":
			{
				"Text": "道具描述"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "43B4EE3E47F02AC1C30179881891F986"
		},
		{
			"Source":
			{
				"Text": "附加BUFF"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "BE36D4B44B7ADFBD5E047EA2244B32A3"
		},
		{
			"Source":
			{
				"Text": "附加主动技"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "9800977C48A34AF047DBF3A0A16BC9E1"
		},
		{
			"Source":
			{
				"Text": "附加属性"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "9D0C7F2147DACCB8DD929BBF1546E926"
		},
		{
			"Source":
			{
				"Text": "附加被动技"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "8D3EA45F429E1D56EBB8C2BE9D11120D"
		}
	],
	"Subnamespaces": [
		{
			"Namespace": "APIUpdate",
			"Children": [
				{
					"Source":
					{
						"Text": "API Update"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "APIUpdateEntryLable"
				},
				{
					"Source":
					{
						"Text": "As the BP compile failed, stat to refresh all nodes in BP {0}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "RefreshNodeAction_RefreshNodeBP"
				},
				{
					"Source":
					{
						"Text": "Can not get the totoal action count!!!"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InvalidLogSystem"
				},
				{
					"Source":
					{
						"Text": "Cancle"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "APIUpdate_Cancle"
				},
				{
					"Source":
					{
						"Text": "Compile BP {0}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "RefreshNodeAction_CompileBP"
				},
				{
					"Source":
					{
						"Text": "EditorTool"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EditorToolLable"
				},
				{
					"Source":
					{
						"Text": "Experimental"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ExperimentalLable"
				},
				{
					"Source":
					{
						"Text": "Finish Process BP {0}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "RefreshNodeAction_End"
				},
				{
					"Source":
					{
						"Text": "Invalid Asset Data"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InvalidAssetData"
				},
				{
					"Source":
					{
						"Text": "Open all tools which will be used by user"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Tool_Tip"
				},
				{
					"Source":
					{
						"Text": "Refresh Nodes"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "RefreshNodes"
				},
				{
					"Source":
					{
						"Text": "RefreshNodes"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "APIUpdate_RefreshNodes_Label"
				},
				{
					"Source":
					{
						"Text": "RefreshNodes"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "APIUpdate_RefreshNodes_TooTip"
				},
				{
					"Source":
					{
						"Text": "Start"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "APIUpdate_Start"
				},
				{
					"Source":
					{
						"Text": "Start to Process BP {0}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "RefreshNodeAction_Start"
				},
				{
					"Source":
					{
						"Text": "This will be used to update all API to make sure all versions can be transfered automatically"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "APIUpdateEntryToolTip"
				},
				{
					"Source":
					{
						"Text": "Tool"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Tool_Label"
				},
				{
					"Source":
					{
						"Text": "{0}/{1}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ProcessBarText"
				}
			]
		},
		{
			"Namespace": "AssetDependenciesTool",
			"Children": [
				{
					"Source":
					{
						"Text": "AssetTool"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AssetTool"
				},
				{
					"Source":
					{
						"Text": "{0};"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EdtiorAssets4"
				},
				{
					"Source":
					{
						"Text": "{0}个项目资产, 分别是"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EdtiorAssets3"
				},
				{
					"Source":
					{
						"Text": "列出资产对项目目录资产的依赖"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EditorRefProjectAssets"
				},
				{
					"Source":
					{
						"Text": "列出资产对项目目录资产的依赖"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EditorRefProjectAssets_Tooltip"
				},
				{
					"Source":
					{
						"Text": "引用了"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EdtiorAssets2"
				},
				{
					"Source":
					{
						"Text": "检查资产对项目目录资产的依赖"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ExportRefNonEngineAssets"
				},
				{
					"Source":
					{
						"Text": "编辑器资产"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EdtiorAssets1"
				}
			]
		},
		{
			"Namespace": "AssetTypeActions",
			"Children": [
				{
					"Source":
					{
						"Text": "Progress Widget"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "FAssetTypeActions_UBPScirptBase"
				}
			]
		},
		{
			"Namespace": "BlueprintEditor",
			"Children": [
				{
					"Source":
					{
						"Text": "All Worlds"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DebugWorldNothingSelected"
				},
				{
					"Source":
					{
						"Text": "Client"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DebugWorldClient"
				},
				{
					"Source":
					{
						"Text": "Dedicated Server"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DebugWorldDedicatedServer"
				},
				{
					"Source":
					{
						"Text": "Listen Server"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DebugWorldListenServer"
				},
				{
					"Source":
					{
						"Text": "No debug object selected"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DebugObjectNothingSelected"
				},
				{
					"Source":
					{
						"Text": "Server"
					},
					"Translation":
					{
						"Text": "服务器设置"
					},
					"Key": "DebugWorldServer"
				},
				{
					"Source":
					{
						"Text": "Standalone"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DebugWorldStandalone"
				},
				{
					"Source":
					{
						"Text": "selected"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DebugObjectSelected"
				},
				{
					"Source":
					{
						"Text": "spawned"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DebugObjectSpawned"
				}
			]
		},
		{
			"Namespace": "BlueprintTemplateFactory",
			"Children": [
				{
					"Source":
					{
						"Text": "Cancel"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CreateBlueprintTemaplateButtonCancel"
				},
				{
					"Source":
					{
						"Text": "Create Blueprint Template"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CreateBlueprintTemplateTitleKey"
				},
				{
					"Source":
					{
						"Text": "OK"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CreateBlueprintTemaplateButtonOk"
				},
				{
					"Source":
					{
						"Text": "Parent Class:"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ParentClass"
				},
				{
					"Source":
					{
						"Text": "点击打开在线文档"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ClickOnlineDocText"
				}
			]
		},
		{
			"Namespace": "CharacterCreatorViewport",
			"Children": [
				{
					"Source":
					{
						"Text": "Create New MiniGameCharacter Blueprint"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "OnSaveCharacter_Title"
				}
			]
		},
		{
			"Namespace": "ContentAssetTool",
			"Children": [
				{
					"Source":
					{
						"Text": "Asset {0} already exists."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AssetAlreadyExists"
				},
				{
					"Source":
					{
						"Text": "Cancel"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Cancel"
				},
				{
					"Source":
					{
						"Text": "Name"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Name"
				},
				{
					"Source":
					{
						"Text": "OK"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "OK"
				}
			]
		},
		{
			"Namespace": "Contexts",
			"Children": [
				{
					"Source":
					{
						"Text": "CharacterCreator Plugin"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CharacterCreator"
				},
				{
					"Source":
					{
						"Text": "MiniGame3DLayer Plugin"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGame3DLayer"
				}
			]
		},
		{
			"Namespace": "CustomAssetEditor",
			"Children": [
				{
					"Source":
					{
						"Text": "CustomAsset Custom Tab"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Custom Tab"
				},
				{
					"Source":
					{
						"Text": "CustomAsset Editor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "WorkspaceMenu_CustomAssetEditor"
				}
			]
		},
		{
			"Namespace": "EditActiveSkillModify",
			"Children": [
				{
					"Source":
					{
						"Text": "删除"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ContextMenu.Delete"
				},
				{
					"Source":
					{
						"Text": "复制"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ContextMenu.Duplicate"
				},
				{
					"Source":
					{
						"Text": "插入"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ContextMenu.Insert"
				}
			]
		},
		{
			"Namespace": "ExportAPITool",
			"Children": [
				{
					"Source":
					{
						"Text": "API"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "API"
				},
				{
					"Source":
					{
						"Text": "Export API"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ExportAPITool"
				},
				{
					"Source":
					{
						"Text": "Export API(BlueprintCallable)"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ExportAPITool_ExceptBP"
				},
				{
					"Source":
					{
						"Text": "Export All MiniGame Project functions and properties."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ExportAPITool_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Export All MiniGame Project functions and properties.Except BlueprintCallable"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ExportAPITool_ExceptBP_Tooltip"
				},
				{
					"Source":
					{
						"Text": "刷新交互物蓝图"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "RfreshLogicItemBlueprintNode"
				},
				{
					"Source":
					{
						"Text": "刷新数据编辑器里所有交互物蓝图。"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "RfreshLogicItemBlueprintNode_Tooltip"
				},
				{
					"Source":
					{
						"Text": "导出不在DT_BlueprintActionsOverrideConfig表里的所有节点，只用导出C++的CallFunction节点"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ExportActionInfo_Tooltip"
				},
				{
					"Source":
					{
						"Text": "导出项目蓝图节点"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ExportlightgameBlueprintNode"
				},
				{
					"Source":
					{
						"Text": "导出项目蓝图里所有的节点。"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ExportlightgameBlueprintNode_Tooltip"
				},
				{
					"Source":
					{
						"Text": "统计新增加节点"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ExportActionInfo"
				}
			]
		},
		{
			"Namespace": "FCharacterCreatorModule",
			"Children": [
				{
					"Source":
					{
						"Text": "Character Creator"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CharacterCreatorTitle"
				},
				{
					"Source":
					{
						"Text": "CharacterCreator"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "FCharacterToolTabTitle"
				},
				{
					"Source":
					{
						"Text": "Preview"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "PreviewWorld"
				},
				{
					"Source":
					{
						"Text": "工具"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Tools"
				},
				{
					"Source":
					{
						"Text": "工具"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Tools_Tooltip"
				}
			]
		},
		{
			"Namespace": "FGDAM_ProjectSetting",
			"Children": [
				{
					"Source":
					{
						"Text": "Game Data Editor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "WorkspaceMenu_GameData"
				},
				{
					"Source":
					{
						"Text": "MiniGameProjectSetting"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameProjectSetting"
				}
			]
		},
		{
			"Namespace": "FMiniGame3DLayerCommandModule",
			"Children": [
				{
					"Source":
					{
						"Text": "3DLayer Actions"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "3DLayerectionHeader"
				},
				{
					"Source":
					{
						"Text": "None"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "LayerText"
				},
				{
					"Source":
					{
						"Text": "None"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AxisLabel"
				},
				{
					"Source":
					{
						"Text": "None"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EditMode"
				}
			]
		},
		{
			"Namespace": "FMiniGame3DLayerModule",
			"Children": [
				{
					"Source":
					{
						"Text": "3DLayer"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "FMiniGame3DLayerTabTitle"
				}
			]
		},
		{
			"Namespace": "FProcessBPEditorToolbar",
			"Children": [
				{
					"Source":
					{
						"Text": "Opens the Widget Reflector, a handy tool for diagnosing problems with live widgets."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "OpenWidgetReflectorToolTip"
				},
				{
					"Source":
					{
						"Text": "Switch to Client Mode"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ClientModeButtonTooltip"
				},
				{
					"Source":
					{
						"Text": "Switch to Server Mode"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ServerModeButtonTooltip"
				},
				{
					"Source":
					{
						"Text": "Widget Reflector"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "OpenWidgetReflector"
				}
			]
		},
		{
			"Namespace": "GameModeEditor",
			"Children": [
				{
					"Source":
					{
						"Text": "GameMode Editor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "PlacementBrowserTitle"
				},
				{
					"Source":
					{
						"Text": "Level List"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GameModeEditor"
				},
				{
					"Source":
					{
						"Text": "Open Asset GameMode Editor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GameModeEditorTooltip"
				}
			]
		},
		{
			"Namespace": "GDAM_LogicBlueprint",
			"Children": [
				{
					"Source":
					{
						"Text": "Debug Filter"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DebugSelectTitle"
				},
				{
					"Source":
					{
						"Text": "Game Data Editor for logic blueprint"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "WorkspaceMenu_GameData_LogicBlueprint"
				},
				{
					"Source":
					{
						"Text": "Select a world to debug, will filter what to debug if no specific object selected"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "BlueprintDebugWorldTooltip"
				},
				{
					"Source":
					{
						"Text": "Select an object to debug, if set to none will debug any object"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "BlueprintDebugObjectTooltip"
				},
				{
					"Source":
					{
						"Text": "Select this Actor in level"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DebugSelectActor"
				}
			]
		},
		{
			"Namespace": "GraphEditor",
			"Children": [
				{
					"Source":
					{
						"Text": "Change Attribute List Pin Value"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ChangeNameListPinValue_Attribute"
				},
				{
					"Source":
					{
						"Text": "Change Name List Pin Value"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ChangeNameListPinValue"
				}
			]
		},
		{
			"Namespace": "K2Node",
			"Children": [
				{
					"Source":
					{
						"Text": "Animation|Sequence"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "PlaySeqAnimCategory"
				},
				{
					"Source":
					{
						"Text": "Interactor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InteractorMoveTo_Category"
				},
				{
					"Source":
					{
						"Text": "Interactor Move to a target"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "K2Node_InteractorMoveTo_Tooltip"
				},
				{
					"Source":
					{
						"Text": "InteractorMoveTo"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InteractorMoveTo_Title"
				},
				{
					"Source":
					{
						"Text": "Play SeqAnimation"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "PlaySeqAnim"
				},
				{
					"Source":
					{
						"Text": "Plays a Montage on a SkeletalMeshComponent"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "K2Node_PlaySeqAnim_Tooltip"
				},
				{
					"Source":
					{
						"Text": "范围筛选节点中一个范围都没有！"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InvalidCondition"
				}
			]
		},
		{
			"Namespace": "K2Node_CharacterEnterAreaEvent",
			"Children": [
				{
					"Source":
					{
						"Text": "CharacterEnterAreaEvent."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CharacterEnterAreaEvent_Tooltip"
				}
			]
		},
		{
			"Namespace": "K2Node_CharacterExitAreaEvent",
			"Children": [
				{
					"Source":
					{
						"Text": "CharacterEnterAreaEvent."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CharacterEnterAreaEvent_Tooltip"
				}
			]
		},
		{
			"Namespace": "K2Node_CloudVariable",
			"Children": [
				{
					"Source":
					{
						"Text": "云变量名"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CloudVariableName"
				}
			]
		},
		{
			"Namespace": "K2Node_DataReport",
			"Children": [
				{
					"Source":
					{
						"Text": "CannotFindPin ParamName '{0}'"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Error_CannotFindPin"
				},
				{
					"Source":
					{
						"Text": "ParamName '{0}', PinType '{1}', ParamType '{2}'"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Error_DonotSupportPinType"
				},
				{
					"Source":
					{
						"Text": "数据埋点上报"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Data Reporting Node Title"
				},
				{
					"Source":
					{
						"Text": "数据埋点上报"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DataReportingMenuCategory"
				},
				{
					"Source":
					{
						"Text": "数据埋点上报：根据选择的枚举，填充相应数据进行上报"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Data Reporting Tooltip"
				},
				{
					"Source":
					{
						"Text": "数据埋点类型"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DataReportingType"
				}
			]
		},
		{
			"Namespace": "K2Node_FixEaseFunction",
			"Children": [
				{
					"Source":
					{
						"Text": "Alpha value used to specify the easing in time."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AlphaPinTooltip"
				},
				{
					"Source":
					{
						"Text": "BaseAsyncTask: Type not supported or not initialized. @@"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InvalidFunctionName"
				},
				{
					"Source":
					{
						"Text": "Blend Exponent for basic ease functions"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "BlendExpPinDescription"
				},
				{
					"Source":
					{
						"Text": "Easing end value"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "BPinDescription"
				},
				{
					"Source":
					{
						"Text": "Easing result value"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ResultPinDescription"
				},
				{
					"Source":
					{
						"Text": "Easing start value"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "APinDescription"
				},
				{
					"Source":
					{
						"Text": "FixEase"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ContextMenuHeader"
				},
				{
					"Source":
					{
						"Text": "FixEase"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "FixEaseFunction_Title"
				},
				{
					"Source":
					{
						"Text": "Interpolates from value A to value B using a user specified easing function"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NodeTooltip"
				},
				{
					"Source":
					{
						"Text": "Interpolation"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InterpCategory"
				},
				{
					"Source":
					{
						"Text": "Number of steps required to go from A to B"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "StepsPinDescription"
				},
				{
					"Source":
					{
						"Text": "Pin type is not supported by function."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "PinConnectionDisallowed"
				},
				{
					"Source":
					{
						"Text": "Reset to Wildcards"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AddPin"
				},
				{
					"Source":
					{
						"Text": "ResetToDefaults"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ResetToDefaultsTx"
				},
				{
					"Source":
					{
						"Text": "Resets A, B and Results pins to its default wildcard state"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AddPinTooltip"
				},
				{
					"Source":
					{
						"Text": "Specifies the desired ease function to be applied. If connected no customization is possible."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EaseFunsPinDescription"
				},
				{
					"Source":
					{
						"Text": "When interpolating the shortest path should be taken."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ShortestPathPinTooltip"
				}
			]
		},
		{
			"Namespace": "K2Node_GetGameData",
			"Children": [
				{
					"Source":
					{
						"Text": "VariableName"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "VariableName"
				}
			]
		},
		{
			"Namespace": "K2Node_GetLevelCharacter",
			"Children": [
				{
					"Source":
					{
						"Text": "BaseAsyncTask: Type not supported or not initialized. @@"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InvalidFunctionName"
				}
			]
		},
		{
			"Namespace": "K2Node_GetLevelInteractor",
			"Children": [
				{
					"Source":
					{
						"Text": "BaseAsyncTask: Type not supported or not initialized. @@"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InvalidFunctionName"
				}
			]
		},
		{
			"Namespace": "K2Node_LogicEditorEvent",
			"Children": [
				{
					"Source":
					{
						"Text": "An event with logic name and parameters."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AddLogicEditorEvent_Tooltip"
				}
			]
		},
		{
			"Namespace": "K2Node_SpawnLogicObject",
			"Children": [
				{
					"Source":
					{
						"Text": "GameData can not find variable {0} specified."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "SpawnLogicObject_Error"
				}
			]
		},
		{
			"Namespace": "K2Nodes",
			"Children": [
				{
					"Source":
					{
						"Text": "MakeRegion"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MakeRegionHeader"
				},
				{
					"Source":
					{
						"Text": "移除范围"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "RemovePin"
				},
				{
					"Source":
					{
						"Text": "移除范围"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "RemovePinTooltip"
				}
			]
		},
		{
			"Namespace": "LevelList",
			"Children": [
				{
					"Source":
					{
						"Text": "关卡列表"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "PlacementBrowserTitle"
				}
			]
		},
		{
			"Namespace": "LevelListActions",
			"Children": [
				{
					"Source":
					{
						"Text": "Level List"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "LevelEditor"
				},
				{
					"Source":
					{
						"Text": "Level ListItem"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "LevelEditorItem"
				}
			]
		},
		{
			"Namespace": "LevelListWidget",
			"Children": [
				{
					"Source":
					{
						"Text": "Create New Blueprint"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "SLevelListWidget"
				},
				{
					"Source":
					{
						"Text": "New"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "New"
				},
				{
					"Source":
					{
						"Text": "Open Asset Level List Editor, The first Level will be selected by default."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "LevelListTooltip"
				},
				{
					"Source":
					{
						"Text": "主要UI"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MainUI"
				},
				{
					"Source":
					{
						"Text": "关卡列表"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "LevelList"
				},
				{
					"Source":
					{
						"Text": "关卡配置"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Config Level"
				},
				{
					"Source":
					{
						"Text": "创建副本"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DuplicateLevel"
				},
				{
					"Source":
					{
						"Text": "删除关卡"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DeleteLevel"
				},
				{
					"Source":
					{
						"Text": "删除分组"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DeleteGroup"
				},
				{
					"Source":
					{
						"Text": "大厅关卡"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Main Level Text"
				},
				{
					"Source":
					{
						"Text": "定位到当前关卡"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "LocateCurrenLevel"
				},
				{
					"Source":
					{
						"Text": "打开关卡"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "OpenLevel"
				},
				{
					"Source":
					{
						"Text": "新建"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NewMainUI"
				},
				{
					"Source":
					{
						"Text": "新建"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NewGameMode"
				},
				{
					"Source":
					{
						"Text": "新建"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NewGroup"
				},
				{
					"Source":
					{
						"Text": "新建关卡"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NewLevel"
				},
				{
					"Source":
					{
						"Text": "确认删除该分组，删除后，分组内关卡将放入默认组"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DeleteGroupDesc"
				},
				{
					"Source":
					{
						"Text": "移动至"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MoveLevelTo"
				},
				{
					"Source":
					{
						"Text": "编辑"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Edit"
				},
				{
					"Source":
					{
						"Text": "逻辑编写"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Edit Logic"
				},
				{
					"Source":
					{
						"Text": "重命名"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "RenameGroup"
				},
				{
					"Source":
					{
						"Text": "重命名"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "RenameLevel"
				},
				{
					"Source":
					{
						"Text": "默认阶段"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DefaultState"
				}
			]
		},
		{
			"Namespace": "MatchmakingConfig_Customization",
			"Children": [
				{
					"Source":
					{
						"Text": "+ 界面"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AddUIButtonText"
				},
				{
					"Source":
					{
						"Text": "复制模版"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CopyButtonText"
				},
				{
					"Source":
					{
						"Text": "显示样式"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ShowUmgButtonText"
				},
				{
					"Source":
					{
						"Text": "模版选择"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "TemplateSeparatorText"
				},
				{
					"Source":
					{
						"Text": "自定义样式"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CustomSeparatorText"
				},
				{
					"Source":
					{
						"Text": "隐藏样式"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "HideUmgButtonText"
				}
			]
		},
		{
			"Namespace": "MessageTagGraphPin",
			"Children": [
				{
					"Source":
					{
						"Text": "EventName"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MessageTagWidget_Msg"
				}
			]
		},
		{
			"Namespace": "MiniGameEditor",
			"Children": [
				{
					"Source":
					{
						"Text": "ADSettings"
					},
					"Translation":
					{
						"Text": "广告设置"
					},
					"Key": "MiniGameProjectAD"
				},
				{
					"Source":
					{
						"Text": "AI系统"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameAISystem"
				},
				{
					"Source":
					{
						"Text": "About"
					},
					"Translation":
					{
						"Text": "概述"
					},
					"Key": "About"
				},
				{
					"Source":
					{
						"Text": "Add System"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Add System"
				},
				{
					"Source":
					{
						"Text": "AddSystem"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameProjectSettingAddSystemButton"
				},
				{
					"Source":
					{
						"Text": "Appearance"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Appearance"
				},
				{
					"Source":
					{
						"Text": "Back"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Back"
				},
				{
					"Source":
					{
						"Text": "Cfg_Data"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Cfg_Data"
				},
				{
					"Source":
					{
						"Text": "EquippedSystem"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EquippedSystem"
				},
				{
					"Source":
					{
						"Text": "EquippedSystems"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EquippedSystems"
				},
				{
					"Source":
					{
						"Text": "Input"
					},
					"Translation":
					{
						"Text": "输入设置"
					},
					"Key": "MiniGameInput"
				},
				{
					"Source":
					{
						"Text": "Invalid Setting"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Invalid Setting"
				},
				{
					"Source":
					{
						"Text": "Invalid System Category"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Invalid System Category"
				},
				{
					"Source":
					{
						"Text": "Invalid System Information"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Invalid System Information"
				},
				{
					"Source":
					{
						"Text": "LevelSettings"
					},
					"Translation":
					{
						"Text": "关卡设置"
					},
					"Key": "MiniGameLevelSettings"
				},
				{
					"Source":
					{
						"Text": "Light Game Project Thumbnail"
					},
					"Translation":
					{
						"Text": "轻游戏项目缩略图"
					},
					"Key": "LightGameProjectThumbnailLabel"
				},
				{
					"Source":
					{
						"Text": "Login"
					},
					"Translation":
					{
						"Text": "登入设置"
					},
					"Key": "MiniGameLogin"
				},
				{
					"Source":
					{
						"Text": "MiniGame Editor Settings"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameEditorSettingsTabTitle"
				},
				{
					"Source":
					{
						"Text": "MiniGame Settings"
					},
					"Translation":
					{
						"Text": "小游戏设置"
					},
					"Key": "MiniGameSettingsTabTitle"
				},
				{
					"Source":
					{
						"Text": "MiniGameEditor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameEditor"
				},
				{
					"Source":
					{
						"Text": "MiniGameEditorCommonCommand"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameEditorCommonCommand"
				},
				{
					"Source":
					{
						"Text": "MiniGameProjectBase"
					},
					"Translation":
					{
						"Text": "轻游戏基础设置"
					},
					"Key": "MiniGameProjectBase"
				},
				{
					"Source":
					{
						"Text": "MiniGameProjectBase"
					},
					"Translation":
					{
						"Text": "轻游戏基础设置"
					},
					"Key": "MiniGameProjectBaseTip"
				},
				{
					"Source":
					{
						"Text": "MiniGameSetting Actions"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameSettingActions"
				},
				{
					"Source":
					{
						"Text": "ModeID"
					},
					"Translation":
					{
						"Text": "轻游戏ID"
					},
					"Key": "ModeID"
				},
				{
					"Source":
					{
						"Text": "Open MiniGame Setting Viewer"
					},
					"Translation":
					{
						"Text": "打开轻游戏设置界面"
					},
					"Key": "MiniGameSettingButtonTip"
				},
				{
					"Source":
					{
						"Text": "Project description has been saved"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Project description has been saved"
				},
				{
					"Source":
					{
						"Text": "Refresh"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ProjectADRefresh"
				},
				{
					"Source":
					{
						"Text": "Save"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ProjectDescriptorSave"
				},
				{
					"Source":
					{
						"Text": "Server"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameServer"
				},
				{
					"Source":
					{
						"Text": "Settings"
					},
					"Translation":
					{
						"Text": "设置"
					},
					"Key": "QuickSettingsCombo"
				},
				{
					"Source":
					{
						"Text": "Show the AD configuration for project AD"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameProjectADTip"
				},
				{
					"Source":
					{
						"Text": "Show the Login configuration for Login"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameLoginTip"
				},
				{
					"Source":
					{
						"Text": "Show the Login configuration for Login"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameServerTip"
				},
				{
					"Source":
					{
						"Text": "Show the content for the mini game's editor setting"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameEditorTip"
				},
				{
					"Source":
					{
						"Text": "Show the gameplay config"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameplayTip"
				},
				{
					"Source":
					{
						"Text": "Show the input configuration for default level"
					},
					"Translation":
					{
						"Text": "默认关卡的输入配置"
					},
					"Key": "MiniGameLevelSettingsTips"
				},
				{
					"Source":
					{
						"Text": "Show the input configuration for input"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameInputTip"
				},
				{
					"Source":
					{
						"Text": "Unequip"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Unequip"
				},
				{
					"Source":
					{
						"Text": "Unequip System"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Unequip System"
				},
				{
					"Source":
					{
						"Text": "Unequip this settings which will be movied into owned scope. You still own it"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Unequip this settings"
				},
				{
					"Source":
					{
						"Text": "Use Toturial"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Use Toturial"
				},
				{
					"Source":
					{
						"Text": "一些内部编辑器使用功能"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InternalToolTip"
				},
				{
					"Source":
					{
						"Text": "关卡基础逻辑"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DefaultState_Common"
				},
				{
					"Source":
					{
						"Text": "内部"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InternalLable"
				},
				{
					"Source":
					{
						"Text": "功能列表"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "FunctionList"
				},
				{
					"Source":
					{
						"Text": "原生AI系统的细节设置"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameAISystemTip"
				},
				{
					"Source":
					{
						"Text": "可设置树状结构的标签"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameProjectGameplayTagTip"
				},
				{
					"Source":
					{
						"Text": "同步玩法"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameSyncSetting"
				},
				{
					"Source":
					{
						"Text": "同步玩法的细节设置"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameSyncSettingTip"
				},
				{
					"Source":
					{
						"Text": "已添加功能"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Added Function"
				},
				{
					"Source":
					{
						"Text": "广告"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameADSettings"
				},
				{
					"Source":
					{
						"Text": "搜索"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Search"
				},
				{
					"Source":
					{
						"Text": "暂无未添加功能"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "No UnaddedItem to Show"
				},
				{
					"Source":
					{
						"Text": "暂无添加功能"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "No AddedItem to Show"
				},
				{
					"Source":
					{
						"Text": "未添加功能"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "UnAdded Function"
				},
				{
					"Source":
					{
						"Text": "查询打包是上传到服务器的配置"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Cfg_Data_TooTip"
				},
				{
					"Source":
					{
						"Text": "查询游戏配置"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Cfg_Data_Label"
				},
				{
					"Source":
					{
						"Text": "添加功能"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameProjectSettingAddFunctionButton"
				},
				{
					"Source":
					{
						"Text": "玩法标签"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameProjectGameplayTag"
				},
				{
					"Source":
					{
						"Text": "玩法设置"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameplay"
				},
				{
					"Source":
					{
						"Text": "配置可在游戏中观看的广告"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniGameADSettingsTip"
				},
				{
					"Source":
					{
						"Text": "默认阶段"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DefaultState"
				}
			]
		},
		{
			"Namespace": "MiniGameplaySetting_DetailCustomization",
			"Children": [
				{
					"Source":
					{
						"Text": "AttributeSet"
					},
					"Translation":
					{
						"Text": "属性设置"
					},
					"Key": "AttributeSet"
				},
				{
					"Source":
					{
						"Text": "DamageFormula"
					},
					"Translation":
					{
						"Text": "伤害公式"
					},
					"Key": "DamageFormula"
				},
				{
					"Source":
					{
						"Text": "公式配置"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CustomFormulaObjectChannels"
				},
				{
					"Source":
					{
						"Text": "内置属性"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CustomBuiltInAttributeObjectChannels"
				},
				{
					"Source":
					{
						"Text": "阵营配置"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CustomCampObjectChannels"
				}
			]
		},
		{
			"Namespace": "MiniListenMessage",
			"Children": [
				{
					"Source":
					{
						"Text": "AddPin"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AddPinTx"
				},
				{
					"Source":
					{
						"Text": "ListenMessage From Blueprint And C++"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ListenMessage"
				},
				{
					"Source":
					{
						"Text": "RemovePin"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "RemovePinTx"
				}
			]
		},
		{
			"Namespace": "MiniMessageBase",
			"Children": [
				{
					"Source":
					{
						"Text": "AutoCreateRefTerm Expansion: Assignment Error @@"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AutoCreateRefTermPin_AssignmentError"
				},
				{
					"Source":
					{
						"Text": "LogicEvent|MiniMessage"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MiniMessageBase"
				},
				{
					"Source":
					{
						"Text": "SpawnPureVariable Expansion: Assignment Error @@"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AutoCreateRefTermPin_AssignmentError_SpawnPureVariable"
				}
			]
		},
		{
			"Namespace": "MiniNotifyMessage",
			"Children": [
				{
					"Source":
					{
						"Text": "AddPin"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AddPinTx"
				},
				{
					"Source":
					{
						"Text": "NotifyMessage To Blueprint And C++"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NotifyMessage"
				},
				{
					"Source":
					{
						"Text": "RemovePin"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "RemovePinTx"
				}
			]
		},
		{
			"Namespace": "PinTypeSelector",
			"Children": [
				{
					"Source":
					{
						"Text": "Array"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Array"
				},
				{
					"Source":
					{
						"Text": "Array"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ArrayTooltip"
				},
				{
					"Source":
					{
						"Text": "Map"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Map"
				},
				{
					"Source":
					{
						"Text": "Map (Dictionary)"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MapTooltip"
				},
				{
					"Source":
					{
						"Text": "Set"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Set"
				},
				{
					"Source":
					{
						"Text": "Set"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "SetTooltip"
				},
				{
					"Source":
					{
						"Text": "Single"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Single"
				},
				{
					"Source":
					{
						"Text": "Single Variable"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "SingleVariableTooltip"
				}
			]
		},
		{
			"Namespace": "ProcessBPEditor",
			"Children": [
				{
					"Source":
					{
						"Text": "GraphName Mode"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GraphName"
				},
				{
					"Source":
					{
						"Text": "Process Blueprint Title"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ProcessBP_MenuTitle"
				},
				{
					"Source":
					{
						"Text": "Process Blueprint view"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ProcessBP_MenuTitle_view"
				},
				{
					"Source":
					{
						"Text": "{0}({1})"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InteractorEnterRegion"
				},
				{
					"Source":
					{
						"Text": "{0}({1})"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ActorEnterRegion"
				},
				{
					"Source":
					{
						"Text": "{0}({1})"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ActorExitRegion"
				},
				{
					"Source":
					{
						"Text": "{0}({1})"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InteractorExitRegion"
				},
				{
					"Source":
					{
						"Text": "数据编辑器逻辑蓝图"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GameDataLogicBP"
				},
				{
					"Source":
					{
						"Text": "服务端逻辑"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ServerMode"
				},
				{
					"Source":
					{
						"Text": "逻辑浏览器"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Logic Browser"
				},
				{
					"Source":
					{
						"Text": "逻辑浏览器"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ProcessBPEditorTitle"
				},
				{
					"Source":
					{
						"Text": "默认逻辑"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DefaultMode"
				}
			]
		},
		{
			"Namespace": "ProcessBPEditorActions",
			"Children": [
				{
					"Source":
					{
						"Text": "Process BP Editor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ProcessBPEditor"
				}
			]
		},
		{
			"Namespace": "ProcessBPEditorCreator",
			"Children": [
				{
					"Source":
					{
						"Text": "AI逻辑"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AI"
				},
				{
					"Source":
					{
						"Text": "Buff逻辑"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Buff"
				},
				{
					"Source":
					{
						"Text": "Open Process Blueprint Editor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ProcessBPEditortip"
				},
				{
					"Source":
					{
						"Text": "主动技能逻辑"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ActiveSkill"
				},
				{
					"Source":
					{
						"Text": "关卡逻辑"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Level"
				},
				{
					"Source":
					{
						"Text": "可交互物逻辑"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Interactor"
				},
				{
					"Source":
					{
						"Text": "子弹逻辑"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Projectile"
				},
				{
					"Source":
					{
						"Text": "被动技能逻辑"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "PassiveSkill"
				},
				{
					"Source":
					{
						"Text": "角色逻辑"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Character"
				},
				{
					"Source":
					{
						"Text": "过程蓝图编辑器"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ProcessBPEditorName"
				}
			]
		},
		{
			"Namespace": "ProcessBPEditorH",
			"Children": [
				{
					"Source":
					{
						"Text": "Open the World Outliner tab, which provides a searchable and filterable list of all actors in the world."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ProcessBPBrowserTabToolTip"
				}
			]
		},
		{
			"Namespace": "PropertyEditor",
			"Children": [
				{
					"Source":
					{
						"Text": "Multiple Values"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MultipleValues"
				}
			]
		},
		{
			"Namespace": "ReportWidget",
			"Children": [
				{
					"Source":
					{
						"Text": "举报原因最多输入120个字符"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ReportInputError"
				}
			]
		},
		{
			"Namespace": "SGameConfigShowDialog",
			"Children": [
				{
					"Source":
					{
						"Text": "游戏版本阶段"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EnvInput"
				},
				{
					"Source":
					{
						"Text": "获取游戏配置"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ConfigButton"
				},
				{
					"Source":
					{
						"Text": "请选择一个游戏版本阶段"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EnvSelect"
				},
				{
					"Source":
					{
						"Text": "输入ModID"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ModIDInput"
				},
				{
					"Source":
					{
						"Text": "输入版本号"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "VersionInput"
				}
			]
		},
		{
			"Namespace": "SGameModeView",
			"Children": [
				{
					"Source":
					{
						"Text": "Camera Config"
					},
					"Translation":
					{
						"Text": "相机配置"
					},
					"Key": "CameraConfig"
				},
				{
					"Source":
					{
						"Text": "Character"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Character"
				},
				{
					"Source":
					{
						"Text": "Edit"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Edit"
				},
				{
					"Source":
					{
						"Text": "Mode Components"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "ModeComponents"
				},
				{
					"Source":
					{
						"Text": "New"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "New"
				},
				{
					"Source":
					{
						"Text": "Virtual Key"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "VirtualKey"
				}
			]
		},
		{
			"Namespace": "SLevelListWidget",
			"Children": [
				{
					"Source":
					{
						"Text": "EditArea"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "EditArea"
				},
				{
					"Source":
					{
						"Text": "Game Mode"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GameMode"
				},
				{
					"Source":
					{
						"Text": "Map Name"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "MapName"
				},
				{
					"Source":
					{
						"Text": "Name"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Name"
				},
				{
					"Source":
					{
						"Text": "SelectBox"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "SelectBox"
				}
			]
		},
		{
			"Namespace": "SProcessBPSectionDetailWidget",
			"Children": [
				{
					"Source":
					{
						"Text": "新建"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "NewProcessBP"
				}
			]
		},
		{
			"Namespace": "SSelectStringListWidget",
			"Children": [
				{
					"Source":
					{
						"Text": "Filter options for the Class Viewer."
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Filters_Tooltip"
				},
				{
					"Source":
					{
						"Text": "Filters"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Filters"
				},
				{
					"Source":
					{
						"Text": "类型：{0}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "TypeDescription "
				}
			]
		},
		{
			"Namespace": "SUTAdminDialog",
			"Children": [
				{
					"Source":
					{
						"Text": "n/a"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "UnknownColumnText"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "FCharacterCreatorModule",
					"Children": [
						{
							"Source":
							{
								"Text": "打开角色创建工具"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "mOpenCharacterToolWindow_ToolTip"
						},
						{
							"Source":
							{
								"Text": "角色创建工具"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "mOpenCharacterToolWindow"
						}
					]
				},
				{
					"Namespace": "FMiniGame3DLayerCommandModule",
					"Children": [
						{
							"Source":
							{
								"Text": "Delete Layer"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "m_DeleteLayer"
						},
						{
							"Source":
							{
								"Text": "DeleteLayer"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "m_DeleteLayer_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Rename Layer"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "m_RenameLayer"
						},
						{
							"Source":
							{
								"Text": "RenameLayer"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "m_RenameLayer_ToolTip"
						},
						{
							"Source":
							{
								"Text": "关卡工具"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "mOpen3DLayerToolWindow"
						},
						{
							"Source":
							{
								"Text": "打开3D层"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "mOpen3DLayerToolWindow_ToolTip"
						}
					]
				},
				{
					"Namespace": "GameModeEditor",
					"Children": [
						{
							"Source":
							{
								"Text": "GameModeEditor"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenGameModeEditorCommand"
						},
						{
							"Source":
							{
								"Text": "Open GameMode Editor Window,"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenGameModeEditorCommand_ToolTip"
						}
					]
				},
				{
					"Namespace": "LevelListActions",
					"Children": [
						{
							"Source":
							{
								"Text": "Open Level List Editor Window. The first Level is selected by default"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenLeveListCommand_ToolTip"
						},
						{
							"Source":
							{
								"Text": "关卡列表"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenLeveListCommand"
						},
						{
							"Source":
							{
								"Text": "创建副本"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "Duplicate"
						},
						{
							"Source":
							{
								"Text": "创建副本"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "Duplicate_ToolTip"
						},
						{
							"Source":
							{
								"Text": "删除关卡"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "Delete"
						},
						{
							"Source":
							{
								"Text": "删除关卡"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "Delete_ToolTip"
						},
						{
							"Source":
							{
								"Text": "打开关卡"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenLevel"
						},
						{
							"Source":
							{
								"Text": "打开关卡"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenLevel_ToolTip"
						},
						{
							"Source":
							{
								"Text": "新建关卡"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "NewLevel"
						},
						{
							"Source":
							{
								"Text": "新建关卡"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "NewLevel_ToolTip"
						},
						{
							"Source":
							{
								"Text": "编辑大厅关卡"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "EditStartupMap"
						},
						{
							"Source":
							{
								"Text": "编辑大厅关卡"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "EditStartupMap_ToolTip"
						},
						{
							"Source":
							{
								"Text": "设为大厅关卡"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "SetStartupMap"
						},
						{
							"Source":
							{
								"Text": "设为大厅关卡"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "SetStartupMap_ToolTip"
						},
						{
							"Source":
							{
								"Text": "重命名"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "Rename"
						},
						{
							"Source":
							{
								"Text": "重命名"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "Rename_ToolTip"
						}
					]
				},
				{
					"Namespace": "MiniGameEditor",
					"Children": [
						{
							"Source":
							{
								"Text": "MiniGameSettingViewer"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "MiniGameSettingViewer"
						},
						{
							"Source":
							{
								"Text": "Open MiniGame Setting Viewer,"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "MiniGameSettingViewer_ToolTip"
						}
					]
				},
				{
					"Namespace": "ProcessBPEditorActions",
					"Children": [
						{
							"Source":
							{
								"Text": "LogicEditor"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenProcessBPEditorCommand"
						},
						{
							"Source":
							{
								"Text": "Open Process Blueprint Editor Window"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "OpenProcessBPEditorCommand_ToolTip"
						},
						{
							"Source":
							{
								"Text": "编辑当前蓝图的默认值"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "EditClassDefaults_ToolTip"
						},
						{
							"Source":
							{
								"Text": "编辑数据"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "JumpToGameDataEditor"
						},
						{
							"Source":
							{
								"Text": "编辑默认值"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "EditClassDefaults"
						},
						{
							"Source":
							{
								"Text": "跳转到数据编辑器进行数据编辑"
							},
							"Translation":
							{
								"Text": ""
							},
							"Key": "JumpToGameDataEditor_ToolTip"
						}
					]
				}
			]
		},
		{
			"Namespace": "UK2Node_LevelEventGetData",
			"Children": [
				{
					"Source":
					{
						"Text": "Get Level Event Data"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GetLevelEventNodeToolTips"
				}
			]
		},
		{
			"Namespace": "UMG",
			"Children": [
				{
					"Source":
					{
						"Text": "逆时针旋转"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "TweenRotateCounterclockwise"
				},
				{
					"Source":
					{
						"Text": "顺时针旋转"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "TweenRotateClockwise"
				}
			]
		},
		{
			"Namespace": "UNetworkManager",
			"Children": [
				{
					"Source":
					{
						"Text": "游戏错误"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "UNetworkManager_SocketError"
				}
			]
		},
		{
			"Namespace": "UnrealEd",
			"Children": [
				{
					"Source":
					{
						"Text": "Delete Element"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DeleteElement"
				},
				{
					"Source":
					{
						"Text": "Duplicate Element"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "DuplicateElement"
				},
				{
					"Source":
					{
						"Text": "Insert Element"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InsertElement"
				}
			]
		},
		{
			"Namespace": "WXUPLevelObject",
			"Children": [
				{
					"Source":
					{
						"Text": "Get Level Character"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GetLevelCharacter"
				},
				{
					"Source":
					{
						"Text": "Get Level Interactor"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GetLevelInteractor"
				},
				{
					"Source":
					{
						"Text": "可交互物离开区域"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InteractorExitArea"
				},
				{
					"Source":
					{
						"Text": "可交互物进入区域"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InteractorEnterArea"
				},
				{
					"Source":
					{
						"Text": "获取场景中指定对象"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GetLevelObject"
				},
				{
					"Source":
					{
						"Text": "角色离开区域"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AreaExitArea"
				},
				{
					"Source":
					{
						"Text": "角色进入区域"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "AreaEnterArea"
				}
			]
		},
		{
			"Namespace": "WXUPPlayBox",
			"Children": [
				{
					"Source":
					{
						"Text": "Failed"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Pin_Failed"
				},
				{
					"Source":
					{
						"Text": "Game"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GetLightGamePlayerId_Category"
				},
				{
					"Source":
					{
						"Text": "Game Data cloud variable functions"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CloudVariableCategory"
				},
				{
					"Source":
					{
						"Text": "Game Mode: NONE"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GameplayGameModeNodeTile_None"
				},
				{
					"Source":
					{
						"Text": "Game Mode: {ClassName}"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GameplayGameModeNodeTile_ClassName"
				},
				{
					"Source":
					{
						"Text": "GameMode"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GameplayGameModeCategory"
				},
				{
					"Source":
					{
						"Text": "Get Cloud variable value"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GameDataCloudVariableGetterNodeTile"
				},
				{
					"Source":
					{
						"Text": "Get Current Game Mode"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GameplayGameModeNodeTile"
				},
				{
					"Source":
					{
						"Text": "Get Current Player ID"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GetLightGamePlayerId_Tile"
				},
				{
					"Source":
					{
						"Text": "Get Game Data Value"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GetGameDataNodeTile"
				},
				{
					"Source":
					{
						"Text": "Get LevelEvent Data"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GetLevelEventNodeTitle"
				},
				{
					"Source":
					{
						"Text": "Get MiniGame Attribute Value"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GetMiniGameAttributeTitle"
				},
				{
					"Source":
					{
						"Text": "GetGameDatas"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GetGameDataCategory"
				},
				{
					"Source":
					{
						"Text": "GetMiniGameAttributeValue"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GetMiniGameAttributeCategory"
				},
				{
					"Source":
					{
						"Text": "LogicNode"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "SpawnLogicObjectCategory"
				},
				{
					"Source":
					{
						"Text": "PlayerID"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Pin_PlayerId"
				},
				{
					"Source":
					{
						"Text": "Set Cloud variable value"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GameDataCloudVariableSetterNodeTile"
				},
				{
					"Source":
					{
						"Text": "Set MiniGame Attribute"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "SetMiniGame_AttributeCategory"
				},
				{
					"Source":
					{
						"Text": "Set MiniGame Base Attribute"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Set MiniGame_Attribute NodeTile"
				},
				{
					"Source":
					{
						"Text": "Sort"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Custom_Sort"
				},
				{
					"Source":
					{
						"Text": "SortMap"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CustomSortMapCategory"
				},
				{
					"Source":
					{
						"Text": "SortMap"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Custom_SortMap"
				},
				{
					"Source":
					{
						"Text": "Spawn Logic Object"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "SpawnLogicObjectTile"
				},
				{
					"Source":
					{
						"Text": "The cloud variable key should select from the given list"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CloudVariableConnectionDisallowed"
				},
				{
					"Source":
					{
						"Text": "The specific member {0} value is not exist in global Game Data"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "InvalidGameDataMemberValue"
				},
				{
					"Source":
					{
						"Text": "This node will Spawn a Object by property name!"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "SpawnLogicObject_Tip"
				},
				{
					"Source":
					{
						"Text": "This node will get attribute value by attribute name!"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GetMiniGameAttribute"
				},
				{
					"Source":
					{
						"Text": "This node will get game data by property name!"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GetGameData"
				},
				{
					"Source":
					{
						"Text": "This node will return the current game mode reference in world"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GameplayGameMode"
				},
				{
					"Source":
					{
						"Text": "This node will return the current playerID"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GetLightGamePlayerId_Tips"
				},
				{
					"Source":
					{
						"Text": "This node will return the value of cloud variable in game data!"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GameDataCloudVariableValueGetterTooltip"
				},
				{
					"Source":
					{
						"Text": "This node will set mini game base attribute!"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Set MiniGame_Attribute"
				},
				{
					"Source":
					{
						"Text": "This node will set the value of cloud variable in game data!"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "GameDataCloudVariableValueSetterTooltip"
				},
				{
					"Source":
					{
						"Text": "This node will sort a map"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Custom_SortMap_Tip"
				},
				{
					"Source":
					{
						"Text": "This node will sort an arry"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "Custom_Sort_Tip"
				},
				{
					"Source":
					{
						"Text": "获取交互物逻辑脚本"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "UK2Node_DynamicCastLogicItem"
				},
				{
					"Source":
					{
						"Text": "获取交互物逻辑脚本"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "UK2Node_DynamicCastLogicItem_ToolTip"
				},
				{
					"Source":
					{
						"Text": "获取子弹逻辑脚本"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "UK2Node_DynamicCastProjectile"
				},
				{
					"Source":
					{
						"Text": "获取子弹逻辑脚本"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "UK2Node_DynamicCastProjectile_ToolTip"
				},
				{
					"Source":
					{
						"Text": "获取角色逻辑脚本"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "UK2Node_DynamicCastLogicScript_ToolTip"
				},
				{
					"Source":
					{
						"Text": "获取逻辑对象脚本"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "UK2Node_DynamicCastLogicScript"
				},
				{
					"Source":
					{
						"Text": "逻辑转换节点"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "CustomSortCategory"
				}
			]
		}
	]
}